src/Catalogs/Регионы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Регионы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ДополнительныеСвойства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСвойства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Регионы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере()
	ДополнительныеСвойства.Параметры.УстановитьЗначениеПараметра("Объект", Объект.Ссылка);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос("выбрать * из регистрСведений.ДополнительныеСвойства где объект = &Объект и свойство=""email_ОТК""");
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		МЗ = РегистрыСведений.ДополнительныеСвойства.СоздатьМенеджерЗаписи();
		МЗ.Объект = Объект.Ссылка;
		МЗ.Свойство = "email_ОТК";
		МЗ.Записать();
	КонецЕсли;
	ДополнительныеСвойства.Параметры.УстановитьЗначениеПараметра("Объект", Объект.Ссылка);
	//ДополнительныеСвойства.Отбор.
КонецПроцедуры
